---
kind: method
id: M:Autodesk.Revit.DB.Events.ViewPrintingEventArgs.GetSettings
source: html/f196b3b3-9786-974d-88ca-3f3c5e6245fd.htm
---
# Autodesk.Revit.DB.Events.ViewPrintingEventArgs.GetSettings Method

Get the print settings of the active printing session.

## Syntax (C#)
```csharp
public IPrintSetting GetSettings()
```